1498/1498.3/Output/Outer-Fluid/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/Zone_solid_1";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 353;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 353;
    }
    interface
    {
        type            mixed;
        refValue		uniform 293;
        valueFraction	uniform 0.5;
        refGradient		uniform 0;
    }
    outlet
    {
        type            zeroGradient;
    }
    adiabatic
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
